{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Good day",
        "Greetings"
      ],
      "responses": [
        "Hello! My name is Kaveri!,\n How can I assist you in finding your perfect match?"
      ]
    },
    {
      "tag": "membership_info",
      "patterns": [
        "Tell me about membership plans",
        "What are your membership options?",
        "Can you provide information about subscriptions?"
      ],
      "responses": [
        "We offer various membership plans suited to your needs and preferences.",
        "Our memberships cater to different preferences and offer various benefits. How can I help you choose?"
      ]
    },
    {
      "tag": "profile_creation",
      "patterns": [
        "How do I create a profile?",
        "I want to register",
        "Can you help me with profile setup?"
      ],
      "responses": [
        "Creating a profile is simple. You can sign up on our website or app.",
        "Sure! You can register and create your profile easily on our platform."
      ]
    },
    {
      "tag": "matching_assistance",
      "patterns": [
        "Can you help me find a match?",
        "I need assistance in finding a partner",
        "How does the matching process work?"
      ],
      "responses": [
        "Our platform provides personalized matchmaking services based on your preferences.",
        "We assist in finding compatible matches based on your criteria. How can I assist you further?"
      ]
    },
    {
      "tag": "privacy_security",
      "patterns": [
        "Is my information secure?",
        "Tell me about privacy measures",
        "How is my data protected?"
      ],
      "responses": [
        "We prioritize the security and privacy of your information. Your data is protected on our platform.",
        "Your privacy is important to us. We have robust measures in place to ensure the safety of your data."
      ]
    },
    {
      "tag": "subscription_billing",
      "patterns": [
        "How does billing work?",
        "Tell me about subscriptions payment",
        "Can I change my subscription plan?"
      ],
      "responses": [
        "Billing is managed through secure payment gateways. You can easily manage your subscription from your account.",
        "Subscription payments are secure and manageable from your account settings. You have flexibility in managing your plan."
      ]
    },
    {
      "tag": "request user",
      "patterns": [
        "Can you request Admin to get in touch with me",
        "Can you connect me with admin",
        "I need Admin's assistance"
      ],
      "responses": [
        "I do not understood what you said. \n Please select an option \n 1.You want me to connect you with admin ? \n 2.You dont want to connect"
      ]
    },
    {
      "tag": "answer user",
      "patterns": [
        "1"
      ],
      "responses": [
        "I have requested the admin. he will get back to you as soon as possible"
      ]
    },
    {
      "tag": "answer user2",
      "patterns": [
        "2"
      ],
      "responses": [
        "I there anything else I can you you with"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Goodbye", "See you later", "Farewell"],
      "responses": [
        "Goodbye! Best wishes in your search for a life partner.",
        "See you later! If you have more questions, feel free to return.",
        "Farewell! We hope to assist you in finding your perfect match soon."
      ]
    }
  ]
}
